{
    "nav": {
        "about": "About",
        "skills": "Skills",
        "projects": "Projects",
        "games": "Games",
        "contact": "Contact"
    },
    "about": [
        "Hello there! I'm Michaël, I've worked in the video game industry for the past 4 years.",
        "I'm now transitioning to backend development, and I'm always eager to learn new things!"
    ],
    "work": "View my work",
    "skillsSection": "Tools and technologies I use:",
    "gameSection": "Video games",
    "contact": {
        "name": "Name",
        "enterName": "Enter your name",
        "enterEmail": "Enter your email",
        "send": "Send",
        "sending": "Sending...",
        "messageSend": "Message sent successfully!"
    },
    "footer": {
        "rights": "© 2025 Michaël. All rights reserved.",
        "madeWith": "Made with ❤️ using React"
    },
    "projects": {
        "SoftDesk": "SoftDesk is a secure RESTful API designed for issue tracking. The application allows users to create and manage multiple projects, invite collaborators to specific projects, and track issues within those projects. Users can assign labels to issues based on their priority and leave comments to facilitate communication and collaboration. SoftDesk provides an organized and efficient way to monitor and resolve project-related problems.",
        "LITRevu": "LitRevu is a platform designed for sharing and discovering written content reviews. Users can post requests for critiques on books, articles, or any other type of content, as well as directly publish their own reviews. The platform also encourages interaction by allowing users to respond to others’ requests. A subscription system is available to follow your favorite reviewers and stay updated on their latest insights.",
        "AlgoInvest": "An algorithm with a brute force version and an optimized version, designed to calculate the best return on investment for stock purchases, with a maximum budget and criteria such as: a stock can only be purchased once, and fractional shares cannot be bought.",
        "StocksApplication": "This is a project built with ASP.NET Core (.NET 8). It fetches and displays real-time stock prices using the Finnhub API. The project is continuously updated as I progress through my ASP.NET Core journey.",
        "Harmony": "Harmony is a 2D story-driven game. I worked on the project as both a Gameplay Programmer and UI Programmer, focusing on implementing core mechanics and designing intuitive user interfaces that support the narrative experience.",
        "Jusant": "Jusant is a 3D climbing game that emphasizes exploration and environmental storytelling. I contributed to the project as a UI Programmer, developing the menu and HUD systems such as icons appearing above the interactable objects."
    }
}