{
    "nav": {
        "about": "À propos",
        "skills": "Compétences",
        "projects": "Projets",
        "games": "Jeux",
        "contact": "Contact"
    },
    "about": [
        "Bonjour ! Je m'appelle Michaël. J'ai travaillé dans l'industrie du jeu vidéo pendant 4 ans.",
        "Je me reconvertis actuellement dans le développement backend et je suis toujours prêt à apprendre de nouvelles choses !"
    ],
    "work": "Voir mon travail",
    "skillsSection": "Outils et technologies que j’utilise :",
    "gameSection": "Jeux vidéo",
    "contact": {
        "name": "Nom",
        "enterName": "Entrer votre nom",
        "enterEmail": "Entrer votre email",
        "send": "Envoyer",
        "sending": "Envoi...",
        "messageSend": "Message envoyé avec succès !"
    },
    "footer": {
        "rights": "© 2025 Michaël. Tous droits réservés.",
        "madeWith": "Fait avec ❤️ avec React"
    },
    "projects": {
        "SoftDesk": "SoftDesk est une API REST sécurisée conçue pour le suivi de tickets. L'application permet aux utilisateurs de créer et de gérer plusieurs projets, d'inviter des collaborateurs sur des projets spécifiques, et de suivre les problèmes associés à ces projets. Les utilisateurs peuvent attribuer des étiquettes aux tickets selon leur priorité et laisser des commentaires pour faciliter la communication et la collaboration. SoftDesk offre une manière organisée et efficace de surveiller et résoudre les problèmes liés aux projets.",
        "LITRevu": "LITRevu est une plateforme conçue pour le partage et la découverte de critiques de contenus écrits. Les utilisateurs peuvent publier des demandes de critiques sur des livres, articles ou tout autre type de contenu, ainsi que publier directement leurs propres avis. La plateforme favorise également l’interaction en permettant aux utilisateurs de répondre aux demandes des autres. Un système d’abonnement permet de suivre vos critiques favoris et de rester informé de leurs dernières publications.",
        "AlgoInvest": "Un algorithme, avec une version brute force et une version optimisée, conçu pour calculer le meilleur retour sur investissement dans l’achat d’actions, selon un budget maximal et des critères comme : une action ne peut être achetée qu’une seule fois, et les fractions d’actions ne sont pas autorisées.",
        "StocksApplication": "Ce projet, développé avec ASP.NET Core (.NET 8), permet de récupérer et d’afficher en temps réel les prix des actions en utilisant l’API Finnhub. Le projet est continuellement mis à jour au fil de ma progression dans l’apprentissage d’ASP.NET Core.",
        "Harmony": "Harmony est un jeu en 2D axé sur l’histoire. J’ai travaillé sur le projet en tant que programmeur gameplay et programmeur UI, en me concentrant sur l’implémentation des mécaniques principales et la conception d’interfaces utilisateur intuitives qui soutiennent l’expérience narrative.",
        "Jusant": "Jusant est un jeu d’escalade en 3D qui met l’accent sur l’exploration et la narration environnementale. J’ai contribué au projet en tant que programmeur UI, en développant le menu et les systèmes de HUD, comme les icônes apparaissant au-dessus des objets interactifs.",
        "OrdersManagerAPI": "Ce projet est une API développée avec .NET Core, permettant la gestion d'ordres (orders) et de leurs éléments associés (order items). L'API propose des opérations CRUD pour créer, lire, mettre à jour et supprimer des commandes et leurs articles. Elle utilise Entity Framework pour l'accès aux données et MySQL comme base de données."
    }
}