{
    "nav": {
        "about": "À propos",
        "skills": "Compétences",
        "projects": "Projets",
        "games": "Jeux",
        "contact": "Contact"
    },
    "about": [
        "Bonjour ! Je m'appelle Michaël, j'ai travaillé dans l'industrie du jeu vidéo pendant 4 ans en tant que programmeur gameplay.",
        "Je me suis formé dans le développement backend afin de développer de nouvelles compétences, je suis curieux et toujours prêt à apprendre de nouvelles choses !"
    ],
    "work": "Voir mon travail",
    "skillsSection": "Outils et technologies que j’utilise :",
    "gameSection": "Jeux vidéo",
    "contact": {
        "name": "Nom",
        "enterName": "Entrer votre nom",
        "enterEmail": "Entrer votre email",
        "send": "Envoyer",
        "sending": "Envoi...",
        "messageSend": "Message envoyé avec succès !"
    },
    "footer": {
        "rights": "© 2025 Michaël. Tous droits réservés.",
        "madeWith": "Fait avec ❤️ avec React"
    },
    "projects": {
        "SoftDesk": "SoftDesk est une API REST sécurisée conçue pour le suivi de tickets. L'application permet aux utilisateurs de créer et de gérer plusieurs projets, d'inviter des collaborateurs sur des projets spécifiques, et de suivre les problèmes associés à ces projets. Les utilisateurs peuvent attribuer des étiquettes aux tickets selon leur priorité et laisser des commentaires pour faciliter la communication et la collaboration. SoftDesk offre une manière organisée et efficace de surveiller et résoudre les problèmes liés aux projets.",
        "LITRevu": "LITRevu est une plateforme conçue pour le partage et la découverte de critiques de contenus écrits. Les utilisateurs peuvent publier des demandes de critiques sur des livres, articles ou tout autre type de contenu, ainsi que publier directement leurs propres avis. La plateforme favorise également l’interaction en permettant aux utilisateurs de répondre aux demandes des autres. Un système d’abonnement permet de suivre vos critiques favoris et de rester informé de leurs dernières publications.",
        "AlgoInvest": "Un algorithme, avec une version brute force et une version optimisée, conçu pour calculer le meilleur retour sur investissement dans l’achat d’actions, selon un budget maximal et des critères comme : une action ne peut être achetée qu’une seule fois, et les fractions d’actions ne sont pas autorisées.",
        "StocksApplication": "Ce projet, développé avec ASP.NET Core (.NET 8), permet de récupérer et d’afficher en temps réel les prix des actions en utilisant l’API Finnhub. Le projet est continuellement mis à jour au fil de ma progression dans l’apprentissage d’ASP.NET Core.",
        "Harmony": "Harmony est un jeu en 2D axé sur l’histoire. J’ai travaillé sur le projet en tant que programmeur gameplay et programmeur UI, en me concentrant sur l’implémentation des mécaniques principales et la conception d’interfaces utilisateur intuitives qui soutiennent l’expérience narrative.",
        "Jusant": "Jusant est un jeu d’escalade en 3D qui met l’accent sur l’exploration et la narration environnementale. J’ai contribué au projet en tant que programmeur UI, en développant le menu et les systèmes de HUD, comme les icônes apparaissant au-dessus des objets interactifs.",
        "OrdersManagerAPI": "Ce projet est une API développée avec .NET Core, permettant la gestion d'ordres (orders) et de leurs éléments associés (order items). L'API propose des opérations CRUD pour créer, lire, mettre à jour et supprimer des commandes et leurs articles. Elle utilise Entity Framework pour l'accès aux données et MySQL comme base de données.",
        "BudgetManager": "Budget Manager est une application web développée avec Django, conçue pour aider les utilisateurs à gérer facilement leurs finances personnelles. Elle permet aux utilisateurs de créer un compte en toute sécurité, de suivre leurs revenus et leurs dépenses, d’organiser les transactions par catégorie et d’exporter leurs données financières.",
        "EpicEvent": "Epic Event est une application en ligne de commande développée en Python, permettant de gérer les clients, les contrats et les événements pour une société d’organisation événementielle.",
        "OrangeLettings": "Orange County Lettings est une start-up fictive spécialisée dans la location immobilière aux États-Unis. Ce projet scolaire vise à améliorer un site web existant en réduisant la dette technique, en restructurant l’architecture en plusieurs applications modulaires, en intégrant une pipeline CI/CD avec GitHub Actions, en déployant via Render, et en mettant en place la gestion des erreurs et la journalisation des logs avec Sentry.",
        "JuniorOnly": "Une plateforme de recrutement spécialement conçue pour les candidats débutants et les personnes en reconversion professionnelle à la recherche de leur premier poste permanent (CDI) ou à durée déterminée (CDD). Elle aide les utilisateurs à filtrer les offres 'junior' trompeuses et rend la recherche d'emploi plus facile et plus pertinente, avec des options de recherche par secteur, localisation et type de contrat."
    }
}